tutorials/Poiseuille/Circular/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


R       0.00315;
aR      0.70710678;
sq      0.49056604; 
sqArc   0.53773585;

zMax        0.0005;
zMin       -0.0005;

nTheta      50;
factor      0.375;
nZ          1;

scale 1;

vertices
(
    // Square
    (#calc "$R*$sq" #calc "-$R*$sq" $zMin)
    (#calc "-$R*$sq" #calc "-$R*$sq" $zMin)
    (#calc "-$R*$sq" #calc "$R*$sq" $zMin)
    (#calc "$R*$sq" #calc "$R*$sq" $zMin)

    // Circle
    (#calc "$R*$aR" #calc "-$R*$aR" $zMin)
    (#calc "-$R*$aR" #calc "-$R*$aR" $zMin)
    (#calc "-$R*$aR" #calc "$R*$aR" $zMin)
    (#calc "$R*$aR" #calc "$R*$aR" $zMin)

    // Square
    (#calc "$R*$sq" #calc "-$R*$sq" $zMax)
    (#calc "-$R*$sq" #calc "-$R*$sq" $zMax)
    (#calc "-$R*$sq" #calc "$R*$sq" $zMax)
    (#calc "$R*$sq" #calc "$R*$sq" $zMax)

    // Circle
    (#calc "$R*$aR" #calc "-$R*$aR" $zMax)
    (#calc "-$R*$aR" #calc "-$R*$aR" $zMax)
    (#calc "-$R*$aR" #calc "$R*$aR" $zMax)
    (#calc "$R*$aR" #calc "$R*$aR" $zMax)

);

blocks
(
    hex (1 0 3 2 9 8 11 10)
    ($nTheta $nTheta $nZ)
    simpleGrading (1 1 1)

    hex (0 4 7 3 8 12 15 11)
    (#calc "round($nTheta*$factor)" $nTheta $nZ)
    simpleGrading (1 1 1)

    hex (3 7 6 2 11 15 14 10)
    (#calc "round($nTheta*$factor)" $nTheta $nZ)
    simpleGrading (1 1 1)

    hex (2 6 5 1 10 14 13 9)
    (#calc "round($nTheta*$factor)" $nTheta $nZ)
    simpleGrading (1 1 1)

    hex (1 5 4 0 9 13 12 8)
    (#calc "round($nTheta*$factor)" $nTheta $nZ)
    simpleGrading (1 1 1)
);

edges
(
    arc 7 4 ($R 0 $zMin)
    arc 4 5 (0 #calc "-$R" $zMin)
    arc 5 6 (#calc "-$R" 0 $zMin)
    arc 6 7 (0 $R $zMin)

    arc 15 12 ($R 0 $zMax)
    arc 12 13 (0 #calc "-$R" $zMax)
    arc 13 14 (#calc "-$R" 0 $zMax)
    arc 14 15 (0 $R $zMax)

    arc 3 0 (#calc "$R*$sqArc" 0 $zMin)
    arc 0 1 (0 #calc "-$R*$sqArc" $zMin)
    arc 1 2 (#calc "-$R*$sqArc" 0 $zMin)
    arc 2 3 (0 #calc "$R*$sqArc" $zMin)

    arc 11 8 (#calc "$R*$sqArc" 0 $zMax)
    arc 8 9 (0 #calc "-$R*$sqArc" $zMax)
    arc 9 10 (#calc "-$R*$sqArc" 0 $zMax)
    arc 10 11 (0 #calc "$R*$sqArc" $zMax)
);


defaultPatch{
	name walls;
	type wall;
}


boundary
(
	inlet
	{
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (3 0 1 2)
            (3 7 4 0)
            (2 6 7 3)
            (1 5 6 2)
            (0 4 5 1)
        );
    }

	outlet
	{
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (11 10 9 8)
            (11 8 12 15)
            (10 11 15 14)
            (9 10 14 13)
            (8 9 13 12)
        );
    }
);


mergePatchPairs
(
);

// ************************************************************************* //
