tutorials/Poiseuille/Circular/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver         PCG;
        preconditioner	DIC;
        tolerance       1e-10;
        relTol          0.001; 
        //minIter	1;
    }
    
    pFinal
    {
        $p;
        relTol 	0;
    }

    U
    {
        solver          PCG;
        preconditioner	 DIC;
        tolerance       1e-09;
        relTol          0;
        //minIter	1;
    }
    
    
    UFinal
    {
    	$U ;
    	relTol 0;
    }
    
    c 
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0 ;
        //minIter	1;
    }
}

PISO
{
    fixCAve     false;
    fixCflux    true;
    cAve        0.55;

    nCorrectors     6;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
}

// ************************************************************************* //
